Dlubal.TimberPro.IModuleCaseResistance
Case working with loads.

Dlubal.TimberPro.IModuleCaseResistance.GetULSLoadCount
Gets count of ultimate limit state loads.
Returns: Count of ultimate limit state loads.

Dlubal.TimberPro.IModuleCaseResistance.GetULSLoads
Gets ultimate limit state loads.
Returns: Array of ultimate limit state loads.

Dlubal.TimberPro.IModuleCaseResistance.SetULSLoads(System.UInt32@)
Sets ultimate limit state loads.
Loads: Array of ultimate limit state loads.

Dlubal.TimberPro.IModuleCaseResistance.CleanULSLoads
Cleans ultimate limit state loads.

Dlubal.TimberPro.IModuleCaseResistance.GetSLSLoadCount
Gets count of serviceability limit state loads.
Returns: Count of serviceability limit state loads.

Dlubal.TimberPro.IModuleCaseResistance.GetSLSLoads
Gets serviceability limit state loads.
Returns: Array of serviceability limit state loads.

Dlubal.TimberPro.IModuleCaseResistance.SetSLSLoads(System.UInt32@)
Sets serviceability limit state loads.
Loads: Array of serviceability limit state loads.

Dlubal.TimberPro.IModuleCaseResistance.CleanSLSLoads
Cleans serviceability limit state loads.

Dlubal.TimberPro.IModuleCaseResistance.GetFRLoadCount
Gets count of fire resistance loads.
Returns: Count of fire resistance loads.

Dlubal.TimberPro.IModuleCaseResistance.GetFRLoads
Gets fire resistance loads.
Returns: Array of fire resistance loads.

Dlubal.TimberPro.IModuleCaseResistance.SetFRLoads(System.UInt32@)
Sets fire resistance loads.
Loads: Array of fire resistance loads.

Dlubal.TimberPro.IModuleCaseResistance.CleanFRLoads
Cleans fire resistance loads.